In [10]:
import string
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt


from nltk.corpus import stopwords

In [4]:
# read sample data
sample_df = pd.read_csv("../../data/sample_data.csv")
sample_df.head(3)

,train_id,name,item_condition_id,category_name,brand_name,price,shipping,item_description
0,748447,Polaroid Camera,3,Electronics/Cameras & Photography/Film Photogr...,NaN,27.0,1,Film not included
1,674932,Vintage Ashtray,3,Vintage & Collectibles/Housewares/Coaster,NaN,8.0,0,Sip n Smoke ashtray. Would make a cute gift!
2,586672,Matilda Jane weekender nwt,1,Women/Women's Handbags/Other,NaN,52.0,0,NWT. Matilda Jane Clothing weekender bag. Over...

# Extract Information about Text

## 1. Counts
    - Number of Upper Words / Characters
    - Number of Words 
    - Number of Characters

In [18]:
sample_df['upper_word_count'] = sample_df.name.apply(lambda x: len([x for x in x.split() if x.isupper()]))
sample_df['upper_char_count'] = sample_df.name.apply(lambda x: len([x for x in x if x.isupper()]))
sample_df['word_count'] = sample_df.name.apply(lambda x: len(x.split()))
sample_df['char_count'] = sample_df.name.apply(lambda x: len(x))                                                    
sample_df.head(3)

,train_id,name,item_condition_id,category_name,brand_name,price,shipping,item_description,upper_word_count,upper_char_count,word_count,char_count,stopword_count,punctuation_count,number_count
0,748447,Polaroid Camera,3,Electronics/Cameras & Photography/Film Photogr...,NaN,27.0,1,Film not included,0,2,2,15,0,0,0
1,674932,Vintage Ashtray,3,Vintage & Collectibles/Housewares/Coaster,NaN,8.0,0,Sip n Smoke ashtray. Would make a cute gift!,0,2,2,15,0,0,0
2,586672,Matilda Jane weekender nwt,1,Women/Women's Handbags/Other,NaN,52.0,0,NWT. Matilda Jane Clothing weekender bag. Over...,0,2,4,26,0,0,0

## 2. Count Number of Stop words

In [12]:
stop = stopwords.words('english')
sample_df['stopword_count'] = sample_df.name.apply(lambda x: len([x for x in x.split() if x.lower() in stop]))
sample_df.stopword_count.max()

3

## 3. Count Number of Punctuations

In [16]:
sample_df['punctuation_count'] = sample_df.name.apply(lambda x: len([x for x in x if x in string.punctuation]))
sample_df.punctuation_count.max()

8

## 4. Count Number of Numerical Characters

In [15]:
sample_df['number_count'] = sample_df.name.apply(lambda x: len([x for x in x.split() if x.isdigit()]))
sample_df.number_count.max()

3

## 5. Average Word Length

In [19]:
sample_df['avg_word_len'] = sample_df['char_count'] / sample_df['word_count']
sample_df.head(5)

,train_id,name,item_condition_id,category_name,brand_name,price,shipping,item_description,upper_word_count,upper_char_count,word_count,char_count,stopword_count,punctuation_count,number_count,avg_word_len
0,748447,Polaroid Camera,3,Electronics/Cameras & Photography/Film Photogr...,NaN,27.0,1,Film not included,0,2,2,15,0,0,0,7.50
1,674932,Vintage Ashtray,3,Vintage & Collectibles/Housewares/Coaster,NaN,8.0,0,Sip n Smoke ashtray. Would make a cute gift!,0,2,2,15,0,0,0,7.50
2,586672,Matilda Jane weekender nwt,1,Women/Women's Handbags/Other,NaN,52.0,0,NWT. Matilda Jane Clothing weekender bag. Over...,0,2,4,26,0,0,0,6.50
3,846012,Red Full Lace Wig,3,Women/Women's Accessories/Hair Accessories,NaN,69.0,0,12 inches,0,4,4,17,0,0,0,4.25
4,1026408,EQUATE NICOTINE TRANSDERMAL SYSTEM,1,Other/Daily & Travel items/Personal Care,NaN,19.0,0,13 patches left. Too strong for my husband.,4,31,4,34,0,0,0,8.50